Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་རྒྱ་ཆེན་པོའི་རྗེས་སུ་སོང་བའི་སེམས་དང་ལྡན་པ།
en: Mahādeva Chapter 32 Sudhana had a mind that followed the vast conduct of bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔའ་གཞན་དུ་མི་འགྲོ་བའི་ཡེ་ཤེས་ཀྱི་སྤྱོད་ཡུལ་འདོད་པའི་ངང་ཚུལ་ཅན་མངོན་པར་ཤེས་པ་ཆེན་པོ་མངོན་པར་བསྒྲུབ་པའི་ཡུལ་ལ་ཡོན་ཏན་གྱི་ཁྱད་པར་དུ་ལྟ་བ།
en: He had the nature of longing for the scope of the wisdom of the bodhisattva Ananyagāmin. He saw the special qualities of accomplishing great higher cognition.

source: བརྩོན་འགྲུས་བརྟན་པའི་གོ་ཆ་རབ་ཏུ་དགའ་བའི་ཁྱད་པར་ཐོབ་པ།
en: He had attained joy in the armor of stable diligence.

source: བསམ་གྱིས་མི་ཁྱབ་པའི་རྣམ་པར་ཐར་པས་རྣམ་པར་རྩེ་བའི་རྗེས་སུ་སོང་བའི་བསམ་པ་དང་ལྡན་པ་དེ་བྱང་ཆུབ་སེམས་དཔའི་ཡོན་ཏན་གྱི་ས་ལ་ནི་ནན་ཏན་དུ་བྱེད།
en: He had the aspiration to follow the displays of inconceivable liberations. He practiced the qualities of the bodhisattva level.

source: ཏིང་ངེ་འཛིན་གྱི་ས་ལ་ནི་རྣམ་པར་དཔྱོད།
en: He analyzed on the level of samādhi.

source: གཟུངས་ཀྱིས་ལ་ནི་རབ་ཏུ་གནས་པར་བྱེད།
en: He was established on the level of the power of retention.

source: སྨོན་ལམ་གྱི་ས་ལ་ནི་འཇུག་པར་བྱེད།
en: He engaged in the level of prayer.

source: སོ་སོ་ཡང་དག་པར་རིག་པའི་ས་ལ་ནི་རྗེས་སུ་སློབ།
en: He trained in the level of discernment.

source: སྟོབས་ཀྱིས་ལ་ནི་ཡོངས་སུ་བསྒྲུབ་ཅིང་མཐར་གྱིས་གྲོང་ཁྱེར་སྒོ་དང་ལྡན་པ་གང་ན་བ་དེར་སོང་སྟེ།
en: He was accomplishing the level of power. He eventually arrived at the city named Dvāravatī.

source: ལྷ་ལྷ་ཆེན་པོ་ཀུན་དུ་དྲིས་པ་དང་། དེ་ལ་འགྲོ་བ་མང་པོས་བསྟན་པ། རིགས་ཀྱི་བུ་འདེ་རེ། ལྷ་ལྷ་ཆེན་པོ་གྲོང་ཁྱེར་གྱི་ལམ་གྱི་བཞི་མདོ་ན་བདག་ཉིད་ཤིན་ཏུ་ཆེ་བས་སེམས་ཅན་རྣམས་ལ་ཆོས་སྟོན་ཅིང་འདུག་གོ །
en: He inquired about the deity Mahādeva, and many people declared to him, “Noble one, this deva Mahādeva is in the temple at the crossroads of the city, and with greatness of being he is teaching the Dharma to beings.”

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལྷ་ལྷ་ཆེན་པོ་གང་ན་བ་དེར་སོང་སྟེ།
en: Then Sudhana went to where the deity Mahādeva was.

source: ལྷ་ལྷ་ཆེན་པོའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ནས། མདུན་དུ་འདུག་སྟེ་ཐལ་མོ་སྦྱར་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། འཕགས་པ་བདག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ན།
en: He bowed his head to the feet of Mahādeva, stood before him with his hands together in homage, and said, “Ārya, I have developed the aspiration for the highest, complete enlightenment.

source: དེ་ནས་ལྷ་ལྷ་ཆེན་པོས་ལག་པ་བཞི་ཕྱོགས་བཞིར་བརྐྱང་སྟེ། རྒྱ་མཚོ་ཆེན་པོ་བཞི་ལས་ཤིན་ཏུ་མྱུར་བའི་ཤུགས་ཀྱིས་ཆུ་བླངས་ཏེ།
en: The deity Mahādeva extended his four arms, and from the four great oceans and with the power of great speed he brought water and washed his mouth.

source: བདག་གིས་གདོང་བཀྲུས་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་གསེར་གྱི་མེ་ཏོག་གིས་གཏོར་ཏེ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་མཐོང་བར་ཤིན་ཏུ་དཀའ་སྟེ། ཐོས་པར་ཡང་རབ་ཏུ་དཀའོ། །སྐྱེས་བུ་མཆོག་གི་མེ་ཏོག་པུན་ད་རི་ཀ་ནི་འཇིག་རྟེན་གྱི་ཕུལ་དུ་བྱ་བ་ཡིན་པས། ངོ་མཚར་རྨད་དུ་བྱུང་བ་ཡིན་ཏེ།
en: He then scattered golden flowers on Sudhana, the head merchant’s son, and said, “Noble one, it is very difficult to see the bodhisattvas.

source: འཇིག་རྟེན་གྱི་གནས་སུ་གྱུར་པའོ། །
en: It is difficult to hear them.

source: འགྲོ་བའི་རྟེན་དུ་གྱུར་པའོ། །སེམས་ཅན་རྣམས་ལ་སྣང་བ་ཆེན་པོ་འབྱིན་པའོ། །ལམ་རྨོངས་པ་རྣམས་ལ་ལམ་བདེ་བ་སྟོན་པའོ། །ཆོས་ཀྱི་ཚུལ་དུ་གཟུང་བ་ལ་མགོན་དུ་གྱུར་པའོ། །ཐམས་ཅད་མཁྱེན་པའི་གྲོང་ཁྱེར་དུ་ཕྱིན་པར་བྱ་བ་ལ་དེད་དཔོན་ཆེན་པོར་གྱུར་པ་སྟེ།
en: The appearance of the white lotuses that are supreme beings is a great marvel because of its greatness; they are a support for the world, a refuge for beings; they create a great light for beings; they teach the path of truth to those on the path of ignorance; they are guides for those who follow the way of the Dharma; they are great guides for going to the city of omniscience.

source: དེ་ལ་ཁོ་བོ་འདི་སྙམ་དུ་སེམས་སོ། །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་མིང་ནི་སེམས་དྲི་མ་མེད་པ་རྣམས་ལ་རང་གི་ལུས་ཀྱི་གཟུགས་བརྙན་སྟོན་ཅིང་ལུས་རྣམ་པར་དག་པ་རྣམས་ལ་མངོན་པར་སྣང་བ་དང་། ངག་གི་ཉེས་པ་སྤངས་པ་རྣམས་དབྱངས་ཀྱི་སྣང་བ་ཡོངས་སུ་གདོན་པར་བྱེད་པ་དང་། བསམ་པ་དག་པ་རྣམས་ལ་དུས་ཐམས་ཅད་དུ་མངོན་སུམ་དུ་གྱུར་པར་གནས་པས། ལྟ་བ་ངན་པ་འཇོམས་པ་ཡིན་པར་བསམས་སོ། །
en: “Noble one, this is what I think: the bodhisattva mahāsattvas are called the destroyers of wrong views because, with stainless minds, they manifest the appearance of their pure bodies; they manifest the activities of their pure bodies; they shine the light of eloquence of their faultless speech; and with a pure motivation they remain manifest at all times.

source: རིགས་ཀྱི་བུ་ཁོ་བོ་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་སྤྲིན་གྱི་དྲ་བ་ཐོབ་པའོ། །
en: “Noble one, I have attained the bodhisattva liberation called the net of clouds.”

source: སྨྲས་པ་འཕགས་པ་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་བའི་སྤྲིན་གྱི་དྲ་བ་དེའི་ཡུལ་ཇི་ལྟ་བུ་ཞིག་མཆིས། དེ་ནས་ལྷ་ལྷ་ཆེན་པོས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱི་མདུན་དུ་རི་ཆེན་པོ་ཙམ་གྱི་གསེར་གྱི་ཕུང་པོ་དང་། དངུལ་གྱི་ཕུང་པོ་དང་། བཻ་ཌཱུརྱའི་ཕུང་པོ་དང་། ཤེལ་གྱི་ཕུང་པོ་དང་། མུ་ས་ར་གལ་པའི་ཕུང་པོ་དང་། ཨ་སྨ་གར་བྷའི་ཕུང་པོ་དང་། ནོར་བུ་རིན་པོ་ཆེ་ངང་གིས་སྣང་བའི་ཕུང་པོ་དང་། ནོར་བུ་རིན་པོ་ཆེ་དྲི་མ་མེད་པའི་སྙིང་པོའི་ཕུང་པོ་དང་། ནོར་བུ་རིན་པོ་ཆེ་རྣམ་པར་སྣང་བའི་ཕུང་པོ་དང་། ནོར་བུ་རིན་པོ་ཆེ་ཕྱོགས་ཀུན་ཏུ་མངོན་པའི་ཕུང་པོ་དང་། གཙུག་གི་ནོར་བུ་རིན་པོ་ཆེ་དང་། ཅོད་པན་གྱི་ཕུང་པོ་དང་། ནོར་བུ་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱིསེ་མོ་དོའི་ཕུང་པོ་དང་། དཔུང་རྒྱན་གྱི་ཕུང་པོ་དང་། རྣ་ཆའི་རྒྱན་གྱི་ཕུང་པོ་དང་། གདུབ་བུའི་ཕུང་པོ་དང་། སྐ་རགས་ཀྱི་ཕུང་པོ་དང་། རྐང་གདུབ་ཀྱི་ཕུང་པོ་དང་།
en: Sudhana asked him, “What is the scope of the bodhisattva liberation called the net of clouds?”

source: མུ་ཏིག་དམར་པོའི་དྲ་བའི་ཕུང་པོ་དང་། ནོར་བུ་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་ཕུང་པོ་དང་། ཡན་ལག་དང་ཉིང་ལག་ཐམས་ཅད་ཀྱི་རྒྱན་གྱི་ཕུང་པོ་དང་། ནོར་བུ་རིན་པོ་ཆེ་ཡིད་བཞིན་གྱི་རྒྱལ་པོའི་ཕུང་པོ་དང་། མེ་ཏོག་ཐམས་ཅད་དང་། སྤོས་ཐམས་ཅད་དང་། བདུག་པ་ཐམས་ཅད་དང་། ཕྲེང་བ་ཐམས་ཅད་དང་། བྱུག་པ་ཐམས་ཅད་དང་། ཕྱེ་མ་ཐམས་ཅད་དང་། གོས་ཐམས་ཅད་དང་། གདུགས་ཐམས་ཅད་དང་། རྒྱལ་མཚན་ཐམས་ཅད་དང་། ལྷའི་བ་དན་ཐམས་ཅད་དང་། རོལ་མོ་བརྡུང་བ་ཐམས་ཅད་དང་། རོལ་མོ་དཀྲོལ་བ་ཐམས་ཅད་དང་། འདོད་པའི་ཡུལ་ཐམས་ཅད་དང་། བུ་མོ་བྱེ་བ་བརྒྱ་སྟོང་གྲངས་མེད་པ་དག་ཀྱང་ཉེ་བར་བསྟན་ནས།
en: In every direction in front of Sudhana, the head merchant’s son, the deva Mahādeva manifested mountain-sized heaps of gold, heaps of silver, heaps of beryls, heaps of crystals, heaps of white corals, heaps of emeralds, heaps of precious asteria jewels, heaps of precious vimalagarbha jewels, heaps of precious vairocana jewels, heaps of precious topknot jewels, heaps of crowns, heaps of necklaces made of various precious jewels, heaps of armlets, heaps of earrings, heaps of bracelets, heaps of girdles, heaps of anklets, heaps of strings of red pearls, heaps of various precious jewels, heaps of adornment for the greater and smaller parts of the body, heaps of the kings of wish-fulfilling precious jewels, all flowers, all perfumes, all incenses, all garlands, all ointments, all powders, all cloths, all parasols, all banners, all flags, all musical instruments, all percussion instruments, all that is desirable, and countless trillions of maidens.

source: ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་འདི་དག་ལས་ཁྱེར་ལ། སྦྱིན་པ་མང་པོ་ནི་བྱིན་ཅིག །
en: Mahādeva said to Sudhana, the head merchant’s son, “Noble one, take these, and with them perform acts of great generosity!

source: བསོད་ནམས་མང་པོ་ནི་གྱིས་ཤིག །
en: Create much merit!

source: དེ་བཞིན་གཤེགས་པ་རྣམས་ལ་མཆོད་ཅིག །
en: Make offerings to the tathāgatas!

source: སེམས་ཅན་མང་པོ་ནི་སྦྱིན་པས་བསྡུ་བའི་དངོས་པོས་ཡོངས་སུ་བསྡུས་ཏེ།
en: Gather many beings through generosity as a method of gathering pupils!

source: གཏོང་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་ཁོད་ཅིག །
en: Practice the perfection of generosity!

source: འཇིག་རྟེན་ནི་སྦྱིན་པ་ལ་སློབས་ཤིག །
en: Teach the world through generosity!

source: གཏང་བར་དགའ་བ་ཡོངས་སུ་གཏང་བ་ནི་སྟོན་ཅིག །
en: Give that which is difficult to give!

source: རིགས་ཀྱི་བུ་ཁྱོད་ལ་ཁོ་བོས་ཇི་ལྟར་ཡོ་བྱད་ཀྱི་རྣམ་པས་བསྡུད་པ་འདི་བཞིན་དུ་སྦྱིན་པའི་བསམ་པ་དང་། མ་བྲལ་བའི་སེམས་ཅན་ཚད་མེད་པ་དག་གི་བསམ་པའི་རྒྱུད་ཀྱང་གཏོང་བས་ཡོངས་སུ་བསྒོ་བ་བྱེད་དོ། །
en: “Noble one, I gather for you this manner of things, and in that same way I establish in generosity an incalculable number of beings whose minds have an unceasing motivation to give.

source: སངས་རྒྱས་དང་ཆོས་དང་དགེ་འདུན་དང་། བྱང་ཆུབ་སེམས་དཔའ་དང་དགེ་བའི་བཤེས་གཉེན་རྣམས་ལའང་དགེ་བའི་རྩ་བ་བསྐྱེད་ཅིང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡང་དག་པར་བསྐུལ་བ་བྱེད་དོ། །
en: I cause them to generate roots of merit in the Buddha, Dharma, and Saṅgha and the bodhisattvas and kalyāṇamitras, and I inspire them toward the highest, complete enlightenment.

source: རིགས་ཀྱི་བུ་གཞན་ཡང་ཁོ་བོ་ནི་སེམས་ཅན་འདོད་པའི་དགའ་བས་མྱོས་པ། ཡུལ་གྱི་ལོངས་སྤྱོད་ལ་ཡོངས་སུ་ཆགས་པ་རྣམས་ལ་ཡུལ་དེ་དག་མི་སྡུག་པར་བྱིན་གྱིས་རློབ་བོ།།
en: “Moreover, noble one, I bless with the ugliness of sensory objects those beings who are intoxicated by the joys of desire and have attachment to the enjoyment of sensory objects.

source: ཁྲོ་བས་ནོན་པ་དང་ང་རྒྱལ་ཅན་དང་། རྒྱགས་ཤིང་དྲེགས་པ་དང་། རློམ་པ་ཚར་གཅོད་པས། གདུལ་བ་རྣམས་ལ་ནི་གཏུམ་ཞིང་སྲིན་པོ་ལྟར་མི་སྡུག་ལ་འཇིགས་པའི་ལུས་ཤ་ཟ་ཞིང་ཁྲག་འཐུང་བའི་ཚུལ་དང་ལྡན་པར་བསྟན་ཏེ། རློམ་པ་དང་། སྙེམས་པས་འཁྲུག་པ་དེ་དག་ཐམས་ཅད་ཞི་བར་བྱེད་དོ། །
en: “I manifest terrifying wrathful bodies like rākṣasas, eating flesh and drinking blood, to those who are possessed by anger, who are proud, arrogant, conceited, and haughty, and who are to be guided through destruction, pacifying all who are agitated by pride and arrogance.

source: ལེ་ལོ་ཅན་བརྩོན་འགྲུས་བོར་བའི་སེམས་ཅན་རྣམས་ལ་ནི་མེ་དང་། ཆུ་དང་། རྒྱལ་པོ་དང་རྐུན་པོ་དང་། གནོད་པའི་འཇིགས་པ་ཡོངས་སུ་བསྟན་ཅིང་སྐྱོ་བར་བྱས་ཏེ། བརྩོན་འགྲུས་རྩོམ་པ་ལ་འགོད་པར་བྱེད་དོ། །
en: “I manifest the danger of being harmed by fire, water, kings, and thieves for beings who are lazy and abandon diligence, causing them to be distressed and become diligent.

source: དེ་ལྟར་ཐབས་དེ་དང་དེ་དག་གིས་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཐམས་ཅད་ཀྱི་ཕྱོགས་དང་མི་མཐུན་པར་རབ་ཏུ་གཞོམ་པ་དང་། ཕ་རོལ་ཏུ་ཕྱིན་པ་ཐམས་ཅད་ཀྱི་ཚོགས་བསྩགས་པ་དང་། སྒྲིབ་པའི་རིའི་གཡང་སའི་ལམ་ཐམས་ཅད་ལས་ཡང་དག་པར་བཟླ་བ་དང་། སྒྲིབ་པ་མེད་པའི་ཆོས་ལ་གཟུད་པའི་ཕྱིར་མི་དགེ་བ་ཐམས་ཅད་ལས་རྣམ་པར་བཟློག་སྟེ། དགེ་བ་ཐམས་ཅད་ཕུན་སུམ་ཚོགས་པ་ལ་ཡང་དག་པར་འགོད་པ་བྱེད་དོ། །
en: “In that way, through those methods, I turn them away from that which is not virtuous and establish them in a perfection of virtue so that they may defeat all that is adverse to the perfections, gather all the accumulations of the perfections, transcend all the paths of the mountain precipices of obscurations, and enter the unobscured Dharma.

source: རིགས་ཀྱི་བུ་ཁོ་བོས་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་སྤྲིན་གྱི་དྲ་བ་འདི་ཤེས་པར་ཟད་ན། ཁོ་བོས་བྱང་ཆུབ་སེམས་དཔའི་དབང་པོ་ལྟར་ཉོན་མོངས་པའི་ལྷ་མ་ཡིན་རབ་ཏུ་འཇོམས་པ།
en: “Noble one, I know only the bodhisattva liberation called the net of clouds.

source: ཆུ་ལྟར་འགྲོ་བ་ཐམས་ཅད་ཀྱི་སྡུག་བསྔལ་གྱི་མེའི་ཕུང་པོ་ཞི་བར་བྱེད་པ། མེའི་ཕུང་པོ་ལྟར་འགྲོ་བ་ཐམས་ཅད་ཀྱི་སྲེད་པའི་ཆུ་སྐེམས་པ། རླུང་ལྟར་འཛིན་པའི་མངོན་པར་ཆགས་པ་ཐམས་ཅད་ཀྱི་རི་རྣམ་པར་འཐོར་བ། རྡོ་རྗེ་ལྟར་བདག་གི་འདུ་ཤེས་སྲ་བའི་བྲག་རབ་ཏུ་རྙིལ་བ། དེ་དག་གི་སྤྱོད་པ་ཤེས་པའམ།
en: How could I know the conduct or describe the qualities of bodhisattvas who are like Indra defeating the asuras of the kleśas, who are like water extinguishing the mass of fire of the suffering of all beings, who are like a mass of flames drying up the water of the cravings of all beings, who are like a wind scattering the mountain of all clinging to attachment, and who are like thunderbolts shattering the hard rock of the perception of a self?

source: སོང་རིགས་ཀྱི་བུ་འཛམ་བུའི་གླིང་འདི་ཉིད་ཀྱི་ཡུལ་མ་ག་དྷའི་སྙིང་པོ་བྱང་ཆུབ་ན་སའི་ལྷ་མོ་བརྟན་མ་ཞེས་བྱ་བ་འདུག་གིས་དེའི་གན་དུ་སོང་ལ།
en: In this Jambudvīpa, in the land of Magadha, at the bodhimaṇḍa, there is the goddess of the earth who is named Sthāvarā.

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་ལྷ་ལྷ་ཆེན་པོའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། ལྷ་ལྷ་ཆེན་པོ་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས། ཡང་དང་ཡང་བལྟས་ཏེ། ལྷ་ལྷ་ཆེན་པོའི་དྲུང་ནས་སོང་ངོ་། །
en: Then Sudhana, the head merchant’s son, bowed his head to the feet of the deva Mahādeva, circumambulated the deva Mahādeva many hundreds of thousands of times, keeping him to his right, and, looking back again and again, departed from the deva Mahādeva.

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་མཐར་གྱིས་ཡུལ་མ་གདྷའི་སྙིང་པོ་བྱང་ཆུབ་ཏུ་སའི་ལྷ་མོ་བརྟན་མ་གང་ན་བ་དེར་སོང་བ་དང་དེ་འགྲོ་བའི་ཚེ་སའི་ལྷ་མོ་བརྒྱ་སྟོང་ཕྲག་བཅུ་གཅིག་ལ་གཅིག་འདི་སྐད་ཅེས་འཛེར་ཏོ། །
en: Sthāvarā Chapter 33 Then Sudhana, the head merchant’s son, eventually reached the goddess of the earth, Sthāvarā, in the land of Magadha’s bodhimaṇḍa. When he arrived there, one million earth goddesses proclaimed to one another, “Someone who will be a refuge for all beings is coming here!

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་རྟེན་དུ་འགྱུར་བ་ཞིག་ནི་འདི་ནས་ཚུར་འོང་ངོ་། །དེ་བཞིན་གཤེགས་པའི་སྙིང་པོ་ཅན་སེམས་ཅན་ཐམས་ཅད་ཀྱི་མ་རིག་པའི་སྒོ་ངའི་སྦུབས་འདྲ་ལ་བར་འགྱུར་བ་ཞིག་ནི་འདི་ནས་ཚུར་འོང་ངོ་། །
en: Someone who has the essence of the tathāgatas and who will break open the enclosing egg of ignorance of all beings is coming here!

source: ཆོས་ཀྱི་རྒྱལ་པོའི་རིགས་སུ་བྱུང་བ་ཆགས་པ་མེད་ཅིང་དྲི་མ་མེད་པའི་ཆོས་ཀྱི་རྒྱལ་པོའི་གོ་འཕང་དམ་པ་འཐོབ་པར་འགྱུར་བ་ཞིག་ནི་འདི་ནས་ཚུར་འོང་ངོ་། །
en: Someone who is in the family of the kings of Dharma and will attain the state of an unimpeded, stainless king of the Dharma is coming here!

source: ཡེ་ཤེས་ཀྱི་མཐུ་བོ་ཆེ་རྡོ་རྗེའི་མཚོན་ཆ་ཅན་དཔའ་བོ་ཕས་ཀྱི་རྒོལ་བའི་འཁོར་ཐམས་ཅད་རབ་ཏུ་འདུལ་བ་ཞིག་ནི་འདི་ནས་ཚུར་འོང་ངོ་ཞེས་ནས། དེའི་མོད་ལ་ལྷ་མོ་བརྟན་མ་ལ་སྩོགས་པ།
en: Someone who is a hero with the thunderbolt weapon that has the great power of wisdom and who will subdue the circle of opponents is coming here!”

source: སའི་ལྷ་མོ་བརྒྱ་སྟོང་ཕྲག་བཅུས་ས་ཆེན་པོ་རབ་ཏུ་བསྐྱོད་དེ། འབྲུག་སྒྲ་ཟབ་མོ་ལྟ་བུའི་སྒྲ་ཆེན་པོ་གྲག་པར་བྱས་ནས། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འོད་ཆེན་པོས་སྣང་བར་བྱས་ཏེ།
en: At that moment, Sthāvarā and the other one million earth goddesses shook the great earth, caused a loud sound like deep thunder, and illuminated the world realm of a billion worlds with a vast light.

source: ལུས་རིན་པོ་ཆེའི་རྒྱན་དང་། ལྷབ་ལྷུབ་ཐམས་ཅད་ཀྱིས་ཤིན་ཏུ་བརྒྱན་ནས།
en: Their bodies were adorned by all adornments and precious jewelry.

source: གློག་གི་ཕྲེང་བའི་ཚོགས་ནམ་མཁའི་དབྱིངས་ལས་འགྱུ་ཞིང་སྣང་བ་ལྟ་བུ་ཤ་སྟག་དུ་བྱས་ཏེ། ཤིང་ཐམས་ཅད་ཀྱི་མྱུ་གུ་ནི་སྐྱེ་བར་བྱེད། མེ་ཏོག་གི་ཤིང་ཐམས་ཅད་ནི་ཁ་འབུ་བར་བྱེད། ཆུ་ཀླུང་གི་རྒྱུན་ཐམས་ཅད་ནི་འབབ་པར་བྱེད།
en: They shone and moved in the sky like a mass of streaks of lightning.

source: མཚོ་དང་མཚེའུ་དང་ལུ་མ་ཐམས་ཅད་ནི་རྒྱས་པར་བྱེད། སྤོས་ཆུའི་ཆར་པ་ནི་རབ་ཏུ་འབབ་པར་བྱེད། མེ་ཏོག་གི་སྤྲིན་རབ་ཏུ་འཐོར་བའི་རླུང་ཆེན་པོ་ནི་ལྡང་བར་བྱེད། སིལ་སྙན་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ནི་རབ་ཏུ་སྒྲ་སྒྲོག་པར་བྱེད། ལྷ་རྫས་ཀྱི་གཞལ་མེད་ཁང་དང་རྒྱན་གྱི་ཚོགས་མང་པོ་ནི་རབ་ཏུ་འཁྲོལ་བར་བྱེད། བ་ལང་དང་། ཁྱུ་མཆོག་དང་། གླང་པོ་དང་། སྟག་དང་། རི་དགས་ཀྱི་དབང་པོ་ནི་རབ་ཏུ་སྒྲ་འབྱིན་པར་བྱེད། ལྷ་དང་ལྷ་མ་ཡིན་དང་། ཀླུ་དང་འབྱུང་པོའི་དབང་པོ་རྣམས་ནི་འབྲུག་སྒྲ་འབྱིན་པར་བྱེད།
en: They rose up out of the ground, causing the seedlings of all trees to sprout; causing all flowering trees to blossom; causing all rivers to flow; causing lakes, ponds, and reservoirs to rise; causing a great rain of scented water to fall; causing a great wind that scattered a cloud of flowers to blow; causing a quintillion musical instruments to sound; causing a multitude of divine aerial palaces and ornaments to spread; causing the lords of cows, bulls, elephants, tigers, and deer to make their cries; causing the leaders of devas, asuras, nāgas, and bhūtas to roar; causing the great lords of mountains to clash together; and causing trillions of masses of treasures to emerge.

source: རིའི་དབང་པོ་ཆེན་པོ་རྣམས་ནི་ཕན་ཚུན་ཐུག་པར་བྱེད། གཏེར་གྱི་ཚོགས་བྱེ་བ་བརྒྱ་སྟོང་ནི་མངོན་དུ་བྱུང་བར་བྱེད་ཅིང་སའི་འོག་ནས་འཐོན་ཏོ། །དེ་ནས་སའི་ལྷ་མོ་བརྟན་མས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་ཁྱོད་འདིར་འོངས་པ་ལེགས་སོ། །
en: Then the earth goddess Sthāvarā said to Sudhana, the head merchant’s son, “Noble one, it is excellent that you have come here.

source: སའི་ཕྱོགས་འདི་ནི་སྔོན་ཁྱོད་ཀྱི་གནས་སུ་གྱུར་ཏེ། ཁོ་མོའི་མངོན་སུམ་དུ་དགེ་བའི་རྩ་བ་བསྐྱེད་པ་ཡིན་ན།
en: This area is where in the past you dwelled and generated roots of merit, where I am the witness for that.

source: དེའི་རྣམ་པར་སྨྱིན་པའི་ཕྱོགས་འགའ་ཙམ་བལྟ་བར་འདོད་དམ།
en: Do you wish to see just a fraction of their ripening?”

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་སའི་ལྷ་མོ་བརྟན་མའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ།
en: Sudhana, the head merchant’s son, bowed his head to the feet of the earth goddess Sthāvarā.

source: སའི་ལྷ་མོ་བརྟན་མ་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས།
en: He circumambulated the earth goddess Sthāvarā many hundreds of thousands of times, keeping her to his right.

source: སའི་ལྷ་མོ་བརྟན་མའི་མདུན་དུ་འདུག་སྟེ་ཐལ་མོ་སྦྱར་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། །འཕགས་མ་འཚལ་ལོ། །
en: Then he stood before her and, with his hands placed together in homage, said, “Āryā, I do wish it!”

source: དེ་ནས་སའི་ལྷ་མོ་བརྟན་མས་རྐང་པའི་མཐིལ་གྱིས་ས་ཆེན་པོ་ལ་བརྡབས་ཏེ། རིན་པོ་ཆེའི་གཏེར་བྱེ་བ་བརྒྱ་སྟོང་གྲངས་མེད་པ་རབ་ཏུ་བརྒྱན་པ་བསྟན་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་རིན་པོ་ཆེའི་གཏེར་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་འདི་དག་ཀྱང་ཁྱོད་ཀྱི་རྗེས་སུ་འབྲང་བའོ། །
en: Then the earth goddess Sthāvarā stamped on the ground with the sole of her foot and revealed an array of countless millions of millions of precious treasures and said, “Noble one, these millions of millions of precious treasures follow you.

source: ཁྱོད་ཀྱི་སྔོན་དུ་འགྲོ་བའོ། །
en: They go before you.

source: ཁྱོད་ཀྱིས་ཅི་དགར་སྤྱད་པའོ། །
en: You can use them as you like.

source: ཁྱོད་ཀྱི་བསོད་ནམས་ཀྱི་རྣམ་པར་སྨིན་པ་ལས་བྱུང་བའོ། །
en: They come from the ripening of your merit.

source: ཁྱོད་ཀྱི་བསོད་ནམས་ཀྱི་སྟོབས་ཀྱིས་བསྲུངས་པའོ། །
en: They are protected by the power of your merit.

source: འདི་ལས་ལོང་སྟེ། ཁྱོད་ཀྱིས་ཅི་དགོས་པ་དེ་དག་གྱིས་ཤིག །
en: You can take from among them whatever you need.

source: རིགས་ཀྱི་བུ་གཞན་ཡང་ཁོ་མོ་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་ཡེ་ཤེས་ཐུབ་པར་དཀའ་བའི་སྙིང་པོ་ཅན་ཐོབ་པ་སྟེ། དེ་ལྟར་ཁོ་མོ་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་འདི་དང་ལྡན་པས། དེ་བཞིན་གཤེགས་པ་མར་མེ་མཛད་ཚུན་ཆད་དུ་བྱང་ཆུབ་སེམས་དཔའི་རྗེས་སུ་འབྲང་ཞིང་།
en: “Noble one, moreover, I have attained the bodhisattva liberation called the essence of invincible wisdom.

source: རྟག་ཏུ་བསྲུང་བ་ལ་ཞུགས་པ་སྟེ། དེ་ཚུན་ཆད་དུ་རིགས་ཀྱི་བུ་ཁོ་མོ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སེམས་ཀྱི་སྤྱོད་པ་ལ་རྣམ་པར་སྤྱོད་དོ། །ཡེ་ཤེས་ཀྱི་ཡུལ་ལ་འཇུག་གོ །སྨོན་ལམ་གྱི་དཀྱིལ་འཁོར་ཁོང་དུ་ཆུད་པར་བྱེད་དོ། །བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་རྣམ་པར་དག་པ་རྗེས་སུ་རྟོགས་པར་བྱེད་དོ། །ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཀྱི་ཚུལ་གྱི་རྗེས་སུ་འབྲང་ངོ་། །བྱང་ཆུབ་སེམས་དཔའི་མངོན་པར་ཤེས་པ་ཐམས་ཅད་དང་། སེམས་རྒྱ་ཆེན་པོས་རྒྱས་པར་འགེངས་སོ། །བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་སྟོབས་ཀྱིས་དབང་བསྒྱུར་བ་དང་། ཞིང་གི་དྲ་བ་ཐམས་ཅད་རྒྱས་པར་དགང་བ་དང་། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་ལུང་བསྟན་པ་ཡང་དག་པར་མནོད་པ་དང་། དུས་ཐམས་ཅད་དུ་མངོན་པར་འཚང་རྒྱ་བ་ཡང་དག་པར་བསྟན་པ་དང་།
en: Through my possessing this bodhisattva liberation, since the time of the Tathāgata Dīpaṅkara I have constantly followed bodhisattvas and always protected them.

source: ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བའི་ཚུལ་ཐམས་ཅད་དང་། མདོ་སྡེ་ཡང་དག་པར་བརྗོད་པའི་ཆོས་ཀྱི་སྤྲིན་གྱི་ཚུལ་ཐམས་ཅད་དང་། ཆོས་སྣང་བ་ཆེན་པོས་སྣང་བར་བྱ་བའི་ཚུལ་དང་། སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨྱིན་པར་བྱ་བའི་ཚུལ་དང་། སངས་རྒྱས་ཀྱི་རྣམ་པར་འཕྲུལ་པ་ཐམས་ཅད་ཡང་དག་པར་བསྟན་པའི་ཚུལ་ཡང་རྗེས་སུ་རྟོགས་པར་བྱེད་དོ། །
en: Since that time, noble one, I have practiced the mental conduct of the bodhisattvas, been immersed within the scope of wisdom, entered the domain of prayer, realized pure bodhisattva conduct, followed the ways of all samādhis, permeated the vast motivations and higher cognitions of all bodhisattvas, and realized, possessed, and acquired mastery of the powers of all bodhisattvas, the pervasion of the network of all realms, the acquisition of prophecies from all the tathāgatas, the sight at all times of the attainment of buddhahood, all the ways of turning the wheel of the Dharma, all the ways of the clouds of Dharma that elucidate the sūtras, the way of illumination by the great radiance of the Dharma, the way of completely ripening all beings, and the way of the display of all the miraculous manifestations of the buddhas.

source: ཡང་དག་པར་འཛིན་ཏོ། །ཡང་དག་པར་ནོད་དོ། །རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་ཡེ་ཤེས་ཐུབ་པར་དཀའ་བའི་སྙིང་པོ་ཅན་འདི་ཡང་བསྐལ་པ་རི་རབ་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་ཕ་རོལ་དེའི་ཡང་ཕ་རོལ་ཅིག་ཏུ་འཇིག་རྟེན་གྱི་ཁམས་ཟླ་བའི་རྒྱལ་མཚན་ཞེས་བྱ་བར་བསྐལ་པ་སྣང་བས་རྣམ་པར་བརྒྱན་པ་ལ་དེ་བཞིན་གཤེགས་པ་སྤྱན་བཟང་པོ་ལས་ཐོབ་སྟེ།
en: “Noble one, I received this bodhisattva liberation, the essence of invincible wisdom, far beyond and even more beyond as many past kalpas as there are atoms in Sumeru, during a kalpa called Avabhāsa­vyūha, in a world realm called Candra­dhvajā, from the Tathāgata Sunetra.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ཁོ་མོ་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་ཡེ་ཤེས་ཐུབ་པར་དཀའ་བའི་སྙིང་པོ་ཅན་འདི་ལ་ཡོངས་སུ་དཔྱོད་དཔྱོད། རྣམ་པར་དཔྱོད་དཔྱོད།
en: “Noble one, in that way, until this Bhadra kalpa, while cultivating, practicing, increasing, and augmenting this bodhisattva liberation called the essence of invincible wisdom, I have never been deprived of the sight of the tathāgatas.

source: ཤིན་དུ་དཔྱོད་དཔྱོད། ཡང་དག་པར་འཕེལ་བར་བྱེད་བྱེད་དེ། ཤིན་ཏུ་རྒྱས་པར་བྱེད་བྱེད་པས། བསྐལ་པ་བཟང་པོ་ལ་ཐུག་གི་བར་དུ་དེ་བཞིན་གཤེགས་པ་མཐོང་བ་དང་མ་བྲལ་ལོ། །དེ་སྲིད་ཀྱི་བར་གྱིས་ཁོ་མོས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཅིག་བསྙེན་བཀུར་ཏོ། །
en: “During that time, I have propitiated as many tathāgata arhat samyak­saṃbuddhas as there are atoms in an anabhilāpyānabhilāpya of buddha realms.

source: དེ་བཞིན་གཤེགས་པ་དེ་དག་ཐམས་ཅད་སྙིང་པོ་བྱང་ཆུབ་ཏུ་གཤེགས་པའི་རྣམ་པར་འཕྲུལ་པ་ཡང་མཐོང་སྟེ།
en: I have seen the miraculous manifestation of all those tathāgatas going to the bodhimaṇḍa.

source: ཁོ་མོ་ནི་དེ་བཞིན་གཤེགས་པ་དེ་དག་ཐམས་ཅད་ཀྱི་དགེ་བའི་རྩ་བ་མངོན་སུམ་དུ་མཐོང་བའོ། །
en: I have witnessed the roots of merit of all those tathāgatas.

source: རིགས་ཀྱི་བུ་ཁོ་མོས་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་ཡེ་ཤེས་ཐུབ་པར་དཀའ་བའི་སྙིང་པོ་ཅན་འདི་ཤེས་པར་ཟད་ན། ཁོ་མོས་བྱང་ཆུབ་སེམས་དཔའ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཞམ་རིང་དུ་འབྲང་བ། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་གསུང་གི་རྗེས་སུ་འབྲང་བ།
en: “Noble one, I know only the bodhisattva liberation called the essence of invincible wisdom.

source: དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་འཇུག་པར་དཀའ་བ་ལ་རབ་ཏུ་ཞུགས་པ། སེམས་ཀྱི་སྐད་ཅིག་གིས་ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་རྒྱས་པར་འགེངས་པའི་ཤུགས་དང་ལྡན་པ། དེ་བཞིན་གཤེགས་པ་དང་མཉམ་པ་ཉིད་དུ་གྱུར་པའི་ལུས་དང་ལྡན་པ། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་དགོངས་པ་དྲི་མ་མེད་པའི་སྙིང་པོར་གྱུར་པ། སངས་རྒྱས་འབྱུང་བ་ཐམས་ཅད་རྟག་ཏུ་མངོན་པར་བསྒྲུབས་པ།
en: How could I know the conduct or describe the qualities of bodhisattvas who attend all tathāgatas, who follow the teaching of all buddhas, who enter into the impenetrable wisdom of the tathāgatas, who have the power to pervade the entire realm of phenomena in one instant of mind, who have bodies that are the same as those of the tathāgatas, who have the essence of the stainless intention of all the buddhas, who always realize all appearances of buddhas, and who are emissaries inseparable from the activity of the buddhas?

source: སངས་རྒྱས་ཀྱི་འཕྲིན་ལས་ཐ་མི་དད་པའི་ཕོ་ཉར་གྱུར་པ།
en: “Depart, noble one.

source: དེ་དག་གི་སྤྱོད་པ་ཤེས་པའམ། ཡོན་ཏན་བརྗོད་པར་ནུས་རེ་སྐན། །སོང་རིགས་ཀྱི་བུ་འཛམ་བུའི་གླིང་འདི་ཉིད་ཀྱི་ཡུལ་མ་ག་དྷ་ཞེས་བྱ་བ་ན་གྲོང་ཁྱེར་སེར་སྐྱའི་གནས་ཞེས་བྱ་བ་ཡོད་དེ། དེ་ན་མཚན་མོའི་ལྷ་མོ་དཔྱིད་དང་ལྡན་པ་ཞེས་བྱ་བ་འདུག་གིས་དེའི་གན་དུ་སོང་ལ།
en: In this Jambudvīpa, in the land of Magadha, in the city of Kapilavastu, is the goddess of the night named Vāsantī.
